app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Jake"], ["last_name", "Flat"], ["created_at", "2020-01-07 02:42:14.828597"], ["updated_at", "2020-01-07 02:42:14.828597"]]
---
	def create
	  @student = Student.new
	  @student.update(params.require(:student).permit(:first_name, :last_name))
	  @student.save

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Flatiron"], ["updated_at", "2020-01-07 03:28:08.060659"], ["id", 3]]
---
	def update
	  @student = Student.find(params[:id])
	  @student.update(params.require(:student).permit(:first_name, :last_name))